/*
Напишете програма, която чете от конзолата цяло число n. Програмата трябва да изведе на
екрана ромб от числа. Първият ред трябва да съдържа само числото n/2 , всеки следващ ред
трябва да съдържа 2 числа, редът n/2 трябва да съдържа всички числа от 1 до n, след което броят
им намалява с 2 на всеки ред.
*/
#include <iostream>
using namespace std;

int main()
{
	int n;
	cout << "n=";
	cin >> n;

	//Горна част на ромба
	for (int i = 2; i <= n; ++i)
	{
		for (int j = n+1; j > i; j--)
			cout << " ";
		for (int j = 1; j <= i - 1; ++j)
		{
			cout << j + 1 << " ";
		}
		cout << "\n";
	}
	//Среден ред
	for (int j = 1; j <= n; ++j)
	{
		cout << j << " ";
	}
	cout << endl;

	//Долна част на ромба
	for (int i = n - 1; i >= 1; --i)
	{
		for (int j = n; j > i; j--)
			cout << " ";
		for (int j = 1; j <= i; ++j)
		{
			cout << j + 1 << " ";
		}
		cout << "\n";
	}
	return 0;
}